{"events": [{"display_date": "", "background": "#333333", "end_date": {"month": "12", "day": "15", "year": "2011"}, "text": {"headline": "Another Flickr Example", "text": "It's Easy to Make Your Own Timeline"}, "media": {}, "type": "", "start_date": {"month": 11, "day": 1, "year": 2011}, "event_types": []}, {"display_date": "", "background": "http://knightlab.northwestern.edu/wp-content/uploads/2015/03/front-page-image.jpg", "end_date": {"time": "07:30:00", "month": "11", "day": "16", "year": "2011"}, "text": {"headline": "Vimeo Example", "text": "Illustrate your Timeline with photos, videos, tweets and more."}, "media": {}, "type": "", "start_date": {"time": "05:58:44", "month": 11, "day": 16, "year": 2011}, "event_types": []}, {"display_date": "", "background": "", "end_date": {"year": "1750"}, "text": {"headline": "Jonathan Edwards resided in Northampton, MA", "text": ""}, "media": {}, "type": "", "start_date": {"year": 1726}, "event_types": []}, {"display_date": "", "background": "", "end_date": {}, "text": {"headline": "", "text": ""}, "media": {}, "type": "", "start_date": {"year": ""}, "event_types": []}, {"display_date": "August 28, 1667", "background": "", "end_date": {}, "text": {"headline": "Robin killed in a meadow", "text": "Robin, listed as \"Indian servant to Nathaniel Clark\", died. The full record states \"Robin, an Indian Servant to Nathanell Clark, was killed by the Indians August 26, 1667, And the Jury gave in their verdict that he had his mortall wound in the head, for his Scull was so broken his brains Could be seene to the breadth of the palme of A mans hand, And the skin of his head was taken, or Head with the hair.\" Trumbull gives this account of Robin’s death: “...[he] was killed in the meadows during the summer. He was shot while riding his horse, ‘the skin and hair of his head being taken away.’ About the same time many cattle and swine were destroyed in the meadows by the same party of Indians. Some of them were killed and portions of their flesh carried off, while others were wounded. Complaint was made to the General Court, and such forcible arguments brought to bear on the chiefs of the Mohawks, that within a couple of years the [Indigenous people] made restitution for these unlawful acts. Twenty pounds of leather was placed in the custody of the County Court for this purpose. The amount as apportioned to those who suffered, in proportion to their loss. To Northampton £7 was awarded, viz. ‘ to the heirs of Nathaniel Clarke, for his Indian Servant, killed by said Magnaws, £3.10; to Joseph Parsons £1.10; and the rest 40s. to Joseph Parsons, Joseph Leeds, Thomas Mason & Enos Kingsley, to be distributed by Lt. Clarke.’ Hadley received £8 and Springfield £5. The leather was placed in the hands of Simon Lobdell of Springfield, and he was to pay the award in shoes in ‘merchantable ware and reasonable prices.’” (Register of the deaths in Northampton; Judd Manuscript; Trumbull, History of Northampton, Massachusetts)"}, "media": {"url": "https://drive.google.com/file/d/1nEiDtAae_tWVvTcmV0Qn06hVH0tRBbTW/view?usp=sharing"}, "type": "", "start_date": {"month": 8, "day": 28, "year": 1667}, "event_types": []}, {"display_date": "August 19, 1675", "background": "", "end_date": {}, "text": {"headline": "A letter about an Indigenous man", "text": "An Indigenous man whose name we do not know was the subject of a letter from John Pynchon to John Winthrop Jr. during King Philip's War. The letter gives some details about his life. He lived in or near Northampton with a great deal of his family. He is also an interesting example of the divided loyalties during King Philip's War, since the entire letter is about the writer and all of the people around him questioning his loyalties. It also shows the hostility of the community toward this man."}, "media": {}, "type": "", "start_date": {"month": 8, "day": 19, "year": 1675}, "event_types": []}, {"display_date": "Between 1678-1680", "background": "", "end_date": {"year": "1680"}, "text": {"headline": "Jack enslaved by Samuel Wolcott", "text": "Jack brought to Northampton, possibly from Haddam, and enslaved by Samuel Wolcott in Wethersfield, CT. Samuel Wolcott was a violent man who was charged multiple times for acts of violence against his servants and even had an indentured servant named Hugh Peck removed from his custody by the court. Wolcott treated Jack in a similar manner, as Jack would later state that his reason for taking his freedom was that Wolcott \"always beates him sometimes with 100 blows\" and stated that the effects of these beatings were so brutal that \"he hath told his Master that he would sometimes of other hang himself.\" (Account book of Samuel Wolcott; Pynchon Court Record)"}, "media": {}, "type": "", "start_date": {"year": 1678}, "event_types": []}, {"display_date": "January 27, 1680", "background": "", "end_date": {}, "text": {"headline": "Caleb died", "text": "Caleb died. Little is known about Caleb other than the fact that he was an Indigenous man, potentially enslaved by Joshua Henshaw. (Massachusetts Vital Records)"}, "media": {}, "type": "", "start_date": {"month": 1, "day": 27, "year": 1680}, "event_types": []}, {"display_date": "June 1681", "background": "", "end_date": {}, "text": {"headline": "Jack took his freedom and later jailed", "text": "Jack took his freedom from Samuel Wolcott. At some point in the next week, he made his way through Southfield and stole a gun. Later that week or the next, he came to the home of Anthony Dorchester (probably in Springfield) and asked for tobacco. He then stole the knife used to cut the tobacco, grabbed a cutlass in the home, and threatened Dorchester with it. Dorchcester was able to grab Jack and his family helped tie Jack up. Once tied up, Dorchester found the knife he had stolen. Jack was jailed for this offence on July 1. Some historians state that he escaped from prison, but it cannot be explicitly confirmed. (Pynchon Court Record)"}, "media": {}, "type": "", "start_date": {"month": 6, "year": 1681}, "event_types": []}, {"display_date": "July 14, 1681", "background": "", "end_date": {}, "text": {"headline": "Jack sentenced to death", "text": "Jack set William Clark's house on fire. He ran away but was later caught and confessed. He stated that the fire was unintentional, but even arson with no fatalities could be a capital offense. He pleaded not guilty, but was found guilty, sentenced to death, hanged in Boston, and then burned with another woman of color named Maria convicted of arson. (Pynchon Court Record)"}, "media": {}, "type": "", "start_date": {"month": 7, "day": 14, "year": 1681}, "event_types": []}, {"display_date": "1692", "background": "", "end_date": {}, "text": {"headline": "Mingo and Hannah charged and tried for fornication", "text": "Mingo (enslaved by Samuel Parsons) and Hannah (enslaved by Timothy Baker) were charged and tried for fornication. The court notes state that \"she owned the fact [that she was guilty] and accused Mingo as the father of her child in open court.\" They were sentenced to 15 lashes on their naked bodies. Since both Mingo and Hannah were enslaved, their child would be born into slavery. The child would belong to both Parsons and Baker until the child was nine years old. Then, either Parsons or Baker would pay the other half the value that they assigned to the child and take full ownership or continue joint property of the child. Mingo does eventually marry, but we do not know if it was Hannah. Additionally, Samuel Parsons moved to Springfield at some point after this and Mingo moved with him. (Judd Manuscript)"}, "media": {}, "type": "", "start_date": {"year": 1692}, "event_types": []}, {"display_date": "1714", "background": "", "end_date": {}, "text": {"headline": "Ishmael in Northampton", "text": "Ishmael included in the Judd Manuscript as \"Ishmael Negro\", but little else is known about him. He was of childbearing age in 1714, when his second child was born. He also married Johanah and their child was named Peter."}, "media": {}, "type": "", "start_date": {"year": 1714}, "event_types": []}, {"display_date": "December 2, 1714", "background": "", "end_date": {}, "text": {"headline": "Peter born", "text": "Peter born. He is listed as the son of Ishmael. Peter is a common name, but it is worth noting that this Peter and the Peter enslaved by the Bartlett family may have been the same person. (Genealogy Record, Judd Manuscript)"}, "media": {}, "type": "", "start_date": {"month": 12, "day": 2, "year": 1714}, "event_types": []}, {"display_date": "Between 1715-1740", "background": "", "end_date": {}, "text": {"headline": "Bathsheba Hull born, married, and had children", "text": "Bathsheba Hull born at some point between 1715 and 1740 based on her childbearing years. She was recorded as a member of First Church later in life. She was married to Amos Hull Sr. and together they had five children, Amos Jr. (born 1754), Asaph (born 1755), Margaret (born 1757), Agrippa (born 1759) and Margaret (born 1761). (First Churches Records)"}, "media": {}, "type": "", "start_date": {"year": 1715}, "event_types": []}, {"display_date": "Between 1716-1718", "background": "", "end_date": {"year": "1718"}, "text": {"headline": "Venus born in West Africa", "text": "Venus was likely born in West Africa. (Minkema, Jonathan Edwards' Defense of Slavery)"}, "media": {}, "type": "", "start_date": {"year": 1716}, "event_types": []}, {"display_date": "1722", "background": "", "end_date": {}, "text": {"headline": "Tony born, enslaved, and gained his freedom", "text": "Tony born. At some point, he was enslaved by Ezra Clapp in Westfield, MA. Tony gained his freedom. At some point preceding 1781, Clapp attempted to re-enslave Tony. (\"Uncovering the Stories of Black Families in Springfield and Hampden County, Massachusetts, 1650-1865\" in Historical Journal of Western Massachusetts, Westfield State University)"}, "media": {}, "type": "", "start_date": {"year": 1722}, "event_types": []}, {"display_date": "1723", "background": "", "end_date": {}, "text": {"headline": "Nanne in Northampton", "text": "Nanne or \"Nanny\" listed as \"Negro girl\" in 1723 probate record of Benjamin Lyman. Nanne is probably a nickname, suggesting her full name may have been Ann or Anne. (Hampshire Council of Government Records)"}, "media": {}, "type": "", "start_date": {"year": 1723}, "event_types": []}, {"display_date": "September 5, 1724", "background": "", "end_date": {}, "text": {"headline": "Mingo listed in Samuel Parsons' will", "text": "Mingo listed in Samuel Parsons' will. Parsons asked that his four sons \"shall Take care of...my Aged Nego Man Named Mingo & his wife.\" Mingo was likely enslaved by Parsons for much of his life. (The Parsons Family: Descendants of Cornet Joseph Parsons, compiled by Gerald James Parsons)"}, "media": {}, "type": "", "start_date": {"month": 9, "day": 5, "year": 1724}, "event_types": []}, {"display_date": "1727", "background": "", "end_date": {}, "text": {"headline": "Coffee listed in Samuel Marshall's will", "text": "Coffee listed as a \"servant\" in his enslaver Samuel Marshall's will. Marshall left Coffee to his daughters to sell and divide the profits."}, "media": {}, "type": "", "start_date": {"year": 1727}, "event_types": []}, {"display_date": "1728", "background": "", "end_date": {}, "text": {"headline": "Boston listed in Ebenezer Strong's will", "text": "Boston (who also went by the name George) listed as an \"indian slave\" in Ebenezer Strong's 1728 will. Ebenezer Strong was a ruling elder of the church."}, "media": {}, "type": "", "start_date": {"year": 1728}, "event_types": []}, {"display_date": "1728", "background": "", "end_date": {}, "text": {"headline": "A person of color listed in John Lancton's will", "text": "A person of color whose name we do not know was listed as a \"negro servant\" and enslaved by John Lancton/Langton, listed in Lancton's 1728 probate record. The record stated their value at £60."}, "media": {}, "type": "", "start_date": {"year": 1728}, "event_types": []}, {"display_date": "1729", "background": "", "end_date": {}, "text": {"headline": "A \"negro boy\" listed in the inventory of Ebenezer Strong", "text": "A \"negro boy\" whose name we do not know was listed in the inventory of the estate of Ebenezer Strong in 1729. This inventory recorded him with the value of £80."}, "media": {}, "type": "", "start_date": {"year": 1729}, "event_types": []}, {"display_date": "June 7, 1731", "background": "", "end_date": {}, "text": {"headline": "Venus enslaved by Jonathan Edwards", "text": "Venus enslaved by Jonathan Edwards at fourteen years old. She was the first person Edwards enslaved. Edwards paid 80 pounds to Richard Perkins in Newport, RI to enslave Venus. Kenneth Minkema's paper Jonathan Edwards’s Defense of Slavery has good details on the lives of Perkins and the witnesses to the sale, who were traders of enslaved persons, as well as privateers. The only reason that we know about this sale is that Edwards used the receipt for Venus as scrap paper, and kept the notes that he wrote on the back of it. Since no one has yet found documentation of Venus after the sale, Minkema has posited that she and Leah may have been the same person, and that perhaps Edwards changed her name to Leah, or that she chose Leah on her entry into the church. It's also possible that Edwards sold her or that she passed away. (Minkema, Jonathan Edwards's Defense of Slavery)"}, "media": {}, "type": "", "start_date": {"month": 6, "day": 7, "year": 1731}, "event_types": []}, {"display_date": "mid 1730s", "background": "", "end_date": {}, "text": {"headline": "Rose Binney born", "text": "Rose Binney born, possibly in West Africa. (Jones, Stockbridge, Past and Present)"}, "media": {}, "type": "", "start_date": {"year": 1735}, "event_types": []}, {"display_date": "1735", "background": "", "end_date": {}, "text": {"headline": "Sampson indentured by Stephen Belden", "text": "Sampson described as an \"Indian servant man\" and indentured by Stephen Belden, noted in Belden's 1735 will. The will noted that he had five years, eight months left on his term, but that he would be released \"provided he behave himself.\" The will left Sampson to Belden's wife, Mindwell Wright."}, "media": {}, "type": "", "start_date": {"year": 1735}, "event_types": []}, {"display_date": "January 26, 1735", "background": "", "end_date": {}, "text": {"headline": "Jonah baptized", "text": "Jonah baptized. His baptism record lists him as \"Jonah Negro\", a \"negro servant to Maj. Pomeroy\", referring to Seth Pomeroy. (First Churches Records)"}, "media": {}, "type": "", "start_date": {"month": 1, "day": 26, "year": 1735}, "event_types": []}, {"display_date": "August 31, 1735", "background": "", "end_date": {}, "text": {"headline": "Jesse baptized", "text": "Jesse baptized. He was a servant to Major Pomeroy, or Seth Pomeroy. (First Churches Records)"}, "media": {}, "type": "", "start_date": {"month": 8, "day": 31, "year": 1735}, "event_types": []}, {"display_date": "August 31, 1735", "background": "", "end_date": {}, "text": {"headline": "Josie baptized", "text": "Josie baptized. She was listed as a member of the Church of Christ in Northampton and was a \"servant\" to Major Ebenezer Pomeroy. (First Churches Records)"}, "media": {}, "type": "", "start_date": {"month": 8, "day": 31, "year": 1735}, "event_types": []}, {"display_date": "December 21, 1735", "background": "", "end_date": {}, "text": {"headline": "Elizabeth baptized", "text": "Elizabeth baptized. She was enslaved by Colonel John Stoddard and a member of the Church of Christ in Northampton. (First Churches Records)"}, "media": {}, "type": "", "start_date": {"month": 12, "day": 21, "year": 1735}, "event_types": []}, {"display_date": "February 22, 1736", "background": "", "end_date": {}, "text": {"headline": "Simon baptized", "text": "Simon baptized. He was probably ensalved by Captain Timothy Dwight II, as his baptism record referred to him as a \"servant to Captain Dwight\", and was a member of the Church of Christ in Northampton. There is less to indicate his race here than with some of the other people, but the fact that the record does not list his last name and refers to him as a servant is suggestive.(First Churches Records)"}, "media": {}, "type": "", "start_date": {"month": 2, "day": 22, "year": 1736}, "event_types": []}, {"display_date": "April 11, 1736", "background": "", "end_date": {}, "text": {"headline": "Leah baptized", "text": "Leah baptized. She was enslaved by Jonathan Edwards and his wife Sarah Pierrepoint Edwards. She was a full member of the Church of Christ in Northampton. Leah primarily worked in the home. She and Venus may also have been the same person, and that perhaps Edwards changed her name to Leah, or she chose Leah on her entry to the church. (First Churches Records)"}, "media": {}, "type": "", "start_date": {"month": 4, "day": 11, "year": 1736}, "event_types": []}, {"display_date": "August 1, 1736", "background": "", "end_date": {}, "text": {"headline": "Ishmael baptized", "text": "Ishmael baptized, and was a \"servant\" to Nathan Edwards. He was a member of the Church of Christ in Northampton. (First Churches Records)"}, "media": {}, "type": "", "start_date": {"month": 8, "day": 1, "year": 1736}, "event_types": []}, {"display_date": "1737", "background": "", "end_date": {}, "text": {"headline": "Josie treated by Dr. Crouch", "text": "Josie treated by Dr. Crouch with pills, mercury plaster, and lignum vitae. (Judd Manuscript)"}, "media": {}, "type": "", "start_date": {"year": 1737}, "event_types": []}, {"display_date": "1738", "background": "", "end_date": {}, "text": {"headline": "Josie continues to be treated by Dr. Crouch", "text": "Josie visited 27 times by Dr. Crouch. He gave her more lignum vitae and recorded \"began her salivation\". She may have been beginning to salivate as a side effect of being treated with mercury or by the doctor attempting to induce excessive salivation by other means. It is uncertain what ailment Josie had, but given the reference to salivation and mercury, he believed her ailment was caused by an excess of the humor phlegm, since that was the humor he was trying to remove. Lignum Vitae, also known as the \"tree of life\", was used as a remedy for many illnesses. (Judd Manuscipt)"}, "media": {}, "type": "", "start_date": {"year": 1738}, "event_types": []}, {"display_date": "June 4, 1738", "background": "", "end_date": {}, "text": {"headline": "Dorothy baptized", "text": "Dorothy baptized. She was referred to as a \"servant\" to Benjamin Stebbins. It is possible she is the Dorothy who was married to Jonah in 1739, making her the mother of at least two sons, both named Felix (one died soon after birth) born in 1739 and 1740. (First Churches Records; Northampton, Massachusetts Marriages)"}, "media": {}, "type": "", "start_date": {"month": 6, "day": 4, "year": 1738}, "event_types": []}, {"display_date": "June 4, 1738", "background": "", "end_date": {}, "text": {"headline": "Dinah baptized", "text": "Dinah baptized. Dinah was enslaved by Joseph and Mercy Bartlett. (First Churches Records)"}, "media": {}, "type": "", "start_date": {"month": 6, "day": 4, "year": 1738}, "event_types": []}, {"display_date": "June 7, 1739", "background": "", "end_date": {}, "text": {"headline": "Felix baptized and later died in infancy", "text": "Felix baptized. He was listed as the son of \"Jonah Negro\" in his baptismal record, so he was most likely the son of Jonah and Dorothy. He likely died in infancy, as his brother was also named Felix. At the time it was common practice for a family who lost a child to give the same name to their next child of the same sex. (First Churches Records)"}, "media": {}, "type": "", "start_date": {"month": 6, "day": 7, "year": 1739}, "event_types": []}, {"display_date": "October 26, 1740", "background": "", "end_date": {}, "text": {"headline": "Felix (junior) baptized", "text": "Felix (junior) baptized. He was likely the son of Jonah and Dorothy. (First Churches Records)"}, "media": {}, "type": "", "start_date": {"month": 10, "day": 26, "year": 1740}, "event_types": []}, {"display_date": "1740s", "background": "", "end_date": {}, "text": {"headline": "Jason likely enslaved by Seth Pomeroy", "text": "Jason likely enslaved by Seth Pomeroy, the gunsmith and tavern owner. He became a member of the First Church during Jonathan Edwards' ministry.  (Historical Catalogue of Northampton's First Church)"}, "media": {}, "type": "", "start_date": {"year": 1740}, "event_types": []}, {"display_date": "1740s", "background": "", "end_date": {}, "text": {"headline": "Rose Binney captured", "text": "Rose Binney captured \"when a child...as she was getting water from a spring\", as told by Electa Jones in Stockbridge, Past and Present, a 19th century history of Stockbridge. This story might be apocryphal, but given its general nature, could have a kernel of truth."}, "media": {}, "type": "", "start_date": {"year": 1740}, "event_types": []}, {"display_date": "1740s", "background": "", "end_date": {}, "text": {"headline": "Rose Binney enslaved by Jonathan Edwards and began relationship with Joab", "text": "Rose Binney enslaved by Jonathan Edwards in Northampton, MA. She began a relationship with Joab Binney and some have conjectured that the two were parents of Titus, who was born in the late 1740s or early 1750s. From birth, this first child was enslaved by Edwards. (Jones, Stockbridge, Past and Present)"}, "media": {}, "type": "", "start_date": {"year": 1740}, "event_types": []}, {"display_date": "1740s", "background": "", "end_date": {}, "text": {"headline": "Moidore enslaved by Caleb Strong", "text": "Moidore (also known as Midah) enslaved by Caleb Strong. He was known as an accomplished fiddler and worked in Strong's tannery. (Judd Manuscript; Rozwenc, The Northampton Book)"}, "media": {}, "type": "", "start_date": {"year": 1740}, "event_types": []}, {"display_date": "1740s", "background": "", "end_date": {}, "text": {"headline": "Joab Binney enslaved by Jonathan Hunt III.", "text": "Joab Binney, originally from Africa (country unknown), was enslaved by Jonathan Hunt III. It is also possible he was enslaved by a member of the Strong family. (Northampton Town Papers)"}, "media": {}, "type": "", "start_date": {"year": 1740}, "event_types": []}, {"display_date": "January 18, 1741", "background": "", "end_date": {}, "text": {"headline": "Joab baptized", "text": "Joab baptized and listed as the \"negro servant\" to Mrs. Strong. This could be Joab Binney, but we do not have enough evidence to be confident. (First Churches Records)"}, "media": {}, "type": "", "start_date": {"month": 1, "day": 18, "year": 1741}, "event_types": []}, {"display_date": "Between 1743-1751", "background": "", "end_date": {"year": "1751"}, "text": {"headline": "Titus Binney born and gained his freedom", "text": "Titus Binney born to Rose and Joab Binney. From birth, this first child was enslaved by Edwards. Titus Binney eventually gained his freedom from Edwards in 1750s or 1760s and lived on the Van Schaack estate in Pittsfield, MA. He then received or bought land from Timothy Edwards (of Stockbridge, MA), and lived on that land in Tioga County, NY. (Minkema, Jonathan Edwards' Defense of Slavery; Allen, \"An Address, Delivered at Northampton, Mass\")"}, "media": {}, "type": "", "start_date": {"year": 1743}, "event_types": []}, {"display_date": "1745", "background": "", "end_date": {}, "text": {"headline": "Pompy left to Samuel Clark's son in Clark's will", "text": "Pompy left to Samuel Clark's son in Clark's will. Pompy was enslaved by Samuel Clark. Pompy may have died in 1746."}, "media": {}, "type": "", "start_date": {"year": 1745}, "event_types": []}, {"display_date": "August 1746", "background": "", "end_date": {}, "text": {"headline": "Pompey died", "text": "Pompey, who may have been the same man enslaved by Samuel Clark, died. In one Northampton register, he is listed as \"an Indian.\" (Register of the deaths in Northampton)"}, "media": {}, "type": "", "start_date": {"month": 8, "year": 1746}, "event_types": []}, {"display_date": "1748", "background": "", "end_date": {}, "text": {"headline": "Elizabeth enslaved by Prudence Stoddard", "text": "Elizabeth enslaved by Prudence Stoddard after John Stoddard's death. Elizabeth was listed as a \"Negro maid\" among his property to be valued, at 80 pounds. (John Stoddard Probate Record)"}, "media": {"url": "https://drive.google.com/file/d/1LvQ3ikuc79j7hqiMb_kGvYnbRJbpyfhn/view?usp=sharing"}, "type": "", "start_date": {"year": 1748}, "event_types": []}, {"display_date": "1750s", "background": "", "end_date": {}, "text": {"headline": "Rose Binney gained her freedom", "text": "Rose Binney possibly gained her freedom from Edwards. She was not accounted for in the valuations of his property in 1753 and did not move with Edwards when he left Stockbridge. The account of Dr. Stephen West suggests that by the early 1770s, both Binneys had gained their freedom. (Article by Dr. Stephen West in Minkema, Jonathan Edwards' Defense of Slavery)"}, "media": {}, "type": "", "start_date": {"year": 1750}, "event_types": []}, {"display_date": "1750s", "background": "", "end_date": {}, "text": {"headline": "Joab Binney gained his freedom", "text": "Joab Binney gained his freedom. It is possible that Binney bought his freedom from the wages he may have earned in skilled trades as a tanner and blacksmith. There is also a story, perhaps apocryphal, that Hunt, Binney's enslaver, was angry with Edwards and granted Binney freedom so that he may remain with Rose Binney in Stockbridge, therefore cutting ties between the Hunt family and Edwards. (Jones, Stockbridge, Past and Present)"}, "media": {}, "type": "", "start_date": {"year": 1750}, "event_types": []}, {"display_date": "1750s", "background": "", "end_date": {}, "text": {"headline": "Amos Hull Sr. in Northampton and may have gained his freedom", "text": "Amos Hull Sr. in Northampton. His enslaved status is uncertain: in the First Churches Records, he is listed as a \"servant\" of Jonathan Hunt III, but in Electa Jones' history of Stockbridge it states that he was free. Hull may have gained his freedom later in life. Hull was also listed as being \"In full communion\" with the First Church, indicating full membership and involvement in the Church. (First Churches Records; Jones, Stockbridge, Past and Present)"}, "media": {}, "type": "", "start_date": {"year": 1750}, "event_types": []}, {"display_date": "Between 1750-1751", "background": "", "end_date": {"year": "1751"}, "text": {"headline": "Rose Binney moved to Stockbridge with Edwards", "text": "Rose Binney likely moved to Stockbridge with Edwards and his household after Edwards removed from his position as minister. (Jones, Stockbridge, Past and Present)"}, "media": {}, "type": "", "start_date": {"year": 1750}, "event_types": []}, {"display_date": "1751", "background": "", "end_date": {}, "text": {"headline": "Rose and Joab Binney married", "text": "Rose and Joab Binney married by Edwards. Though marriage was often conducted through the state in colonial Massachusetts, by the beginning of the 18th century it was often performed by a minister. (Minkema, Jonathan Edwards' Defense of Slavery)"}, "media": {}, "type": "", "start_date": {"year": 1751}, "event_types": []}, {"display_date": "1751", "background": "", "end_date": {}, "text": {"headline": "Joab Binney moved to Stockbridge", "text": "Joab Binney moved to Stockbridge. (Article by Dr. Stephen West in Minkema, Jonathan Edwards' Defense of Slavery)"}, "media": {}, "type": "", "start_date": {"year": 1751}, "event_types": []}, {"display_date": "1750s-1760s", "background": "", "end_date": {"year": "1765"}, "text": {"headline": "Bathsheba Hull lived in Northampton as a free woman and bought land", "text": "Bathsheba Hull lived in Northampton as a free woman, after she and Amos purchased their freedom. She and Amos lived in a home near present-day West Street. We do not know the full details of her profession, but we do know that at least on one occasion, she took in laundry for Ebenezer Hunt. When widowed (after 1761), she bought a house and land from John McLane on an island formed by the Mill River Trench. The Trench was the route that waste water from the town's original mill took to get back to the Mill River. The Trench was hard on the land surrounding it and Bathsheba would have had to deal with soil erosion, flooding, and difficulties entering and exiting the island. (Judd Manuscript; Trumbull, History of Northampton, Massachusetts)"}, "media": {}, "type": "", "start_date": {"year": 1750}, "event_types": []}, {"display_date": "1751-1783", "background": "", "end_date": {"year": "1783"}, "text": {"headline": "Joab Binney lived and worked in Stockbridge", "text": "Joab Binney lived in Stockbridge and made a living either as a tanner or a blacksmith. He owned a 10.5 acre farm and had numerous livestock and crops. (Stockbridge Property Valuation)"}, "media": {}, "type": "", "start_date": {"year": 1751}, "event_types": []}, {"display_date": "1752", "background": "", "end_date": {}, "text": {"headline": "A person whose name we do not know was enslaved by Preserved Bartlett", "text": "An person whose name we do not know was enslaved by Preserved Bartlett and listed in 1752 Northampton tax records. (Northampton Town Papers)"}, "media": {}, "type": "", "start_date": {"year": 1752}, "event_types": []}, {"display_date": "1752", "background": "", "end_date": {}, "text": {"headline": "A person whose name we do not know was enslaved by John Stoddard", "text": "A person whose name we do not know was enslaved by Major Jonathan Stoddard and listed in 1752 Northampton tax records. (Northampton Town Papers)"}, "media": {}, "type": "", "start_date": {"year": 1752}, "event_types": []}, {"display_date": "1754", "background": "", "end_date": {}, "text": {"headline": "Amos Hull Jr. born and baptized", "text": "Amos Hull Jr. born to Bathsheba and Amos Hull Sr. and baptized Sept. 15, 1754. (First Churches Records)"}, "media": {}, "type": "", "start_date": {"year": 1754}, "event_types": []}, {"display_date": "1755", "background": "", "end_date": {}, "text": {"headline": "Peter given his freedom and continued working", "text": "Peter given his freedom in Joseph Bartlett's will of 1755. He was previously enslaved by Joseph and Mercy Bartlett. He kept working for Mercy Bartlett, who survived her husband, up until her death in 1759. In Mercy Bartlett's will, he was left the bed he slept on, furniture, farm animals, and tools. This could indicate that Peter was doing farm and caretaker work for the Bartletts. Additionally, the listing of objects in the will suggest that Peter may have slept in the barn or another outbuilding that housed animals. (Probate record of Joseph Bartlett)"}, "media": {}, "type": "", "start_date": {"year": 1755}, "event_types": []}, {"display_date": "1755", "background": "", "end_date": {}, "text": {"headline": "Peter Ladue served in the Fourth French and Indian War", "text": "Peter Ladue listed as serving in the company commanded by Captain Elisha Hawley in what was at the time called the Fourth French and Indian War. He was listed as \"negro\". (Trumbull, History of Northampton, Massachusetts)"}, "media": {}, "type": "", "start_date": {"year": 1755}, "event_types": []}, {"display_date": "1755", "background": "", "end_date": {}, "text": {"headline": "Pamphlet published recounting the crimes of Jack", "text": "A pamphlet was published recounting the crimes of Jack, including charges that he was \"Instigated by the Divill\", portraying Jack as a vicious man who purposefully set fire to the house of William Clark, and in some accounts even locked Clark in the house after setting fire. Ths story may have had some origins in actual facts of the fire, but the retelling is wholly based on a racist interpretation of Jack's actions. It is worth noting here because the fact that a pamphlet was produced about it demonstrates local knowledge and likely how white people around Northampton would have talked about Jack if they knew about him. It also demonstrates that people of color in Northampton might have been hearing about this tale for centuries. (Trumbull, History of Northampton, Massachusetts)"}, "media": {}, "type": "", "start_date": {"year": 1755}, "event_types": []}, {"display_date": "1755", "background": "", "end_date": {}, "text": {"headline": "Dinah given her freedom", "text": "Dinah given her freedom in Joseph Bartlett's will. He also left her four pounds, to be paid two years after his death, if she was not married. If she was married, she would receive the equivalent of four pounds and thirteen shillings in household items on her wedding day. This suggests that she was of a marrying age (late teens or twenties) and may have been enslaved by the Bartlett's as a child."}, "media": {}, "type": "", "start_date": {"year": 1755}, "event_types": []}, {"display_date": "October 16, 1755", "background": "", "end_date": {}, "text": {"headline": "Asaph Hull born and baptized", "text": "Asaph Hull born to Amos Sr. and Bathsheba Hull. He was baptized November 23. (First Churches Records)"}, "media": {}, "type": "", "start_date": {"month": 10, "day": 16, "year": 1755}, "event_types": []}, {"display_date": "1756", "background": "", "end_date": {}, "text": {"headline": "A person whose name we do not know was enslaved by Samuel Mather", "text": "A person whose name we do not know was enslaved by Samuel Mather, a doctor, and listed in 1756 Northampton tax records."}, "media": {}, "type": "", "start_date": {"year": 1756}, "event_types": []}, {"display_date": "1756", "background": "", "end_date": {}, "text": {"headline": "Tax records list a person enslaved by Caleb Strong", "text": "Northampton tax records list Caleb Strong as enslaving one person, but does not list the name of the person. This may have been Moidore. He was also probaby listed in the 1764 town census but not named. (Trumbull, History of Northampton, Massachusetts; Northampton Town Papers)"}, "media": {}, "type": "", "start_date": {"year": 1756}, "event_types": []}, {"display_date": "1756?", "background": "", "end_date": {}, "text": {"headline": "Sylvia Church born", "text": "Sylvia Church born. (Dwight, The History of the Descendants of John Dwight)"}, "media": {}, "type": "", "start_date": {"year": 1756}, "event_types": []}, {"display_date": "1757", "background": "", "end_date": {}, "text": {"headline": "Jack died", "text": "Jack listed as a \"negro servant\" and died in Northampton in 1757. (Register of the deaths in Northampton)"}, "media": {}, "type": "", "start_date": {"year": 1757}, "event_types": []}, {"display_date": "August 14, 1757", "background": "", "end_date": {}, "text": {"headline": "Margaret Hull baptized and died as a young child", "text": "Margaret Hull baptized. She was the third child of Amos and Bathsheba Hull. Margaret died as an infant or young child on Dec. 24, 1757. (First Churches Records; Judd Manuscript)"}, "media": {}, "type": "", "start_date": {"month": 8, "day": 14, "year": 1757}, "event_types": []}, {"display_date": "March 7, 1759", "background": "", "end_date": {}, "text": {"headline": "Agrippa Hull born", "text": "Agrippa Hull born, the son of Bathsheba and Amos Hull. He was their fifth child. (Nash, Russell, and Hodges, Friends of Liberty)"}, "media": {}, "type": "", "start_date": {"month": 3, "day": 7, "year": 1759}, "event_types": []}, {"display_date": "1759", "background": "", "end_date": {}, "text": {"headline": "Mercy Bartlett died and left Dinah many items in her will", "text": "Mercy Bartlett died and in her will, left Dinah many household items including a stallion, kitchen utensils, spinning wheel, and furniture. This grouping of items suggests that she was being set up to have her own household. It could also indicate the type of work she did in the Bartlett house. She was also left books, suggesting that Dinah knew how to read. Though there were some places in the country where teaching an enslaved person to read was illegal, it was legal in Massachusetts at this point."}, "media": {}, "type": "", "start_date": {"year": 1759}, "event_types": []}, {"display_date": "1760s", "background": "", "end_date": {}, "text": {"headline": "Philemon Lee warned out of Northampton", "text": "Philemon Lee, a free man of color, was warned out of Northampton multiple times in the 1760s. He likely had light skin or a possible mixed-race heritage, as one legal filing referred to him as \"mulatto.\" Before he came to Northampton, he lived in Simsbury, CT and his profession was listed as \"laborer.\" (Hampshire Council of Government Records)"}, "media": {}, "type": "", "start_date": {"year": 1760}, "event_types": []}, {"display_date": "February 8, 1761", "background": "", "end_date": {}, "text": {"headline": "Margaret Hull (junior) baptized", "text": "Margaret Hull baptized. She was the fifth child of Amos and Bethsheba Hull. She was the second Hull child named Margaret, as it was customary for families who had lost a child to name the next child of the same sex the name of the child who passed away. (Judd Manuscript)"}, "media": {}, "type": "", "start_date": {"month": 2, "day": 8, "year": 1761}, "event_types": []}, {"display_date": "1761-1768", "background": "", "end_date": {"year": "1768"}, "text": {"headline": "Bathsheba married second husband Philemon Lee", "text": "At some point between 1761 and 1768, Bathsheba married her second husband, Philemon Lee. (Judd Manuscript)"}, "media": {}, "type": "", "start_date": {"year": 1761}, "event_types": []}, {"display_date": "1761-1771", "background": "", "end_date": {"year": "1771"}, "text": {"headline": "Rose and Joab Binney had five children in Stockbridge", "text": "Rose and Joab Binney had four daugters who died in infancy and one daughter who lived, named Tamar. All were born in Stockbridge. (Jones, Stockbridge, Past and Present)"}, "media": {}, "type": "", "start_date": {"year": 1761}, "event_types": []}, {"display_date": "June 19, 1761", "background": "", "end_date": {}, "text": {"headline": "Amos Hull Sr. died", "text": "Amos Hull Sr. died. A valuation of his property noted that he owned two horses and a cow, valued at 5 pounds, 10 shillings. (First Churches Records; Judd Manuscript)"}, "media": {}, "type": "", "start_date": {"month": 6, "day": 19, "year": 1761}, "event_types": []}, {"display_date": "1762", "background": "", "end_date": {}, "text": {"headline": "Asaph Hull placed as an indentured servant", "text": "Asaph Hull placed as an indentured servant in Fairfield, CT, with Seth Pomeroy, son of the gunsmith and soldier. It is likely he was placed there without Bathsheba's approval, since she is not mentioned and the Overseers of the Poor were the people putting him into the arrangement. His father died in 1761, so Bathsheba being a single parent and a woman of color could have played heavily into the town's decision to remove him from his home. (Indentured servitude paper work)"}, "media": {}, "type": "", "start_date": {"year": 1762}, "event_types": []}, {"display_date": "1764", "background": "", "end_date": {}, "text": {"headline": "Dinah listed in a record", "text": "A record indicates that \"there seems to a Dinah also at Moses Kingsley's - not a slave\". Dinah is a common name for women of color at this time, so this may or may not be the same Dinah enslaved by the Bartletts, but it is possible that after Mercy Bartlett's death, she went to live or work in the home of Moses Kingsley. (Judd Manuscript)"}, "media": {}, "type": "", "start_date": {"year": 1764}, "event_types": []}, {"display_date": "1764", "background": "", "end_date": {}, "text": {"headline": "A person whose name we do not know was enslaved by Jonathan Clapp", "text": "A person whose name we do not know was enslaved by Jonathan Clapp, a miller and tavern owner, and listed in the 1764 Northampton census."}, "media": {}, "type": "", "start_date": {"year": 1764}, "event_types": []}, {"display_date": "1764", "background": "", "end_date": {}, "text": {"headline": "A person whose name we do not know was enslaved by Joseph Clapp", "text": "A person whose name we do not know was enslaved by Joseph Clapp and listed in the 1764 Northampton census."}, "media": {}, "type": "", "start_date": {"year": 1764}, "event_types": []}, {"display_date": "1764", "background": "", "end_date": {}, "text": {"headline": "A man whose name we do not know was enslaved by Joseph Hunt", "text": "A man whose name we do not know was enslaved by Joseph Hunt and listed in the 1764 Northampton census. This may be the same person who was also listed in 1759 Northampton tax records, but no gender is known for the person in that entry."}, "media": {}, "type": "", "start_date": {"year": 1764}, "event_types": []}, {"display_date": "1764", "background": "", "end_date": {}, "text": {"headline": "A woman whose name we do not know was enslaved by Joseph Hunt", "text": "A woman whose name we do not know was enslaved by Joseph Hunt and listed in the 1764 Northampton census."}, "media": {}, "type": "", "start_date": {"year": 1764}, "event_types": []}, {"display_date": "1764", "background": "", "end_date": {}, "text": {"headline": "A free person of color was listed in Northampton census", "text": "A free person of color whose name we do not know was listed in the 1764 Northampton census. This person lived in the home of Moses Kingsley."}, "media": {}, "type": "", "start_date": {"year": 1764}, "event_types": []}, {"display_date": "1764", "background": "", "end_date": {}, "text": {"headline": "A person of color listed in Northampton census", "text": "A person of color whose name we do not know was listed in the 1764 Northampton census. This person lived in the home of Zadoc Danks and it is unclear whether this person was enslaved or free."}, "media": {}, "type": "", "start_date": {"year": 1764}, "event_types": []}, {"display_date": "October 5, 1765", "background": "", "end_date": {}, "text": {"headline": "Cato worked in a lead mine", "text": "Cato brought to Northampton by several men from Roxbury, CT to work in a lead mine about 6 miles from Northampton. (Trumbull, History of Northampton, Massachusetts)"}, "media": {}, "type": "", "start_date": {"month": 10, "day": 5, "year": 1765}, "event_types": []}, {"display_date": "October 5, 1765", "background": "", "end_date": {}, "text": {"headline": "Cesar worked in a lead mine", "text": "Cesar brought to Northampton by several men from Roxbury, CT to work in a lead mine about 6 miles from Northampton. (Trumbull, History of Northampton, Massachusetts)"}, "media": {}, "type": "", "start_date": {"month": 10, "day": 5, "year": 1765}, "event_types": []}, {"display_date": "October 5, 1765", "background": "", "end_date": {}, "text": {"headline": "Tom worked in a lead mine", "text": "Tom brought to Northampton by several men from Roxbury, CT to work in a lead mine about 6 miles from Northampton. (Trumbull, History of Northampton, Massachusetts)"}, "media": {}, "type": "", "start_date": {"month": 10, "day": 5, "year": 1765}, "event_types": []}, {"display_date": "1765", "background": "", "end_date": {}, "text": {"headline": "Northampton seized Bathsheba Hull's land", "text": "Northampton claimed rights to the land Bethsheba Hull was living on and forced her to either sell her land or have her house demolished. It seems that she did sell, as the town moved her belongings to the lower end of Pleasant St. in 1768. There is no precise record of the reason why Northampton had a sudden interest in seizing this land, but there are a few ideas: Her status as a landowner and as a woman of color could have made people angry or uncomfortable, causing McLane to use a loophoke he already knew existed. Another idea is that Ithamar Strong build a cider mill on the Island in 1778 and had to pay Northampton half of his profits. The presence of the apple trees would raise the value of the land Hull's house was on, and the chance to take a big cut of the income from those trees would be a motivation for Northampton to seize land that they could claim was legally theirs to begin with. Finally, Philemon Lee, Bathsheba's second husband, had expressed interest in buying property in Northampton. If he could have made an offer to purchase the lot, it would have been taken from the town. Conversely, if she retained the lot and he expanded thteir holdings, they could have become one of the largest landowners in town who were people of color. (Judd Manuscript; Trumbull, History of Northampton, Massachusetts)"}, "media": {}, "type": "", "start_date": {"year": 1765}, "event_types": []}, {"display_date": "1765", "background": "", "end_date": {}, "text": {"headline": "Agrippa Hull fostered by the Binneys", "text": "Agrippa Hull fostered by Joab and Rose Binney in Stockbridge, MA after his mother was evicted from her home in 1765. It seems that Hull kept up a relationship with the Binneys, as some sources refer to them as second parents to him. (Sedgewick, In My Blood)"}, "media": {}, "type": "", "start_date": {"year": 1765}, "event_types": []}, {"display_date": "1765", "background": "", "end_date": {}, "text": {"headline": "Amos Hull Jr. possibly placed in Hadley", "text": "Amos Hull Jr. possibly placed in Hadley after his mother forced off her land. There is a record for an Amos Hull from Hadley who served in several regiments during the American Revolution and deserted either once or twice. He served between 1776 and 1780. (Massachusetts Soldiers and Sailors of the Revolutionary War)"}, "media": {}, "type": "", "start_date": {"year": 1765}, "event_types": []}, {"display_date": "1765", "background": "", "end_date": {}, "text": {"headline": "Margaret Hull remained in Northampton", "text": "Margaret Hull remained in Northampton after Bathsheba Hull forced from her home. We do not know if Bathsheba was able to keep Margaret with her or if Margaret was placed in another Northampton Home. (Trumbull, History of Northampton, Massachusetts; Judd Manuscript)"}, "media": {}, "type": "", "start_date": {"year": 1765}, "event_types": []}, {"display_date": "1765", "background": "", "end_date": {}, "text": {"headline": "Phillis born", "text": "Phillis born. She was the daughter of Peg and was enslaved by the Phelps family in Hadley. Peg was later sold away in order to marry. (Miller, Entangled Lives)"}, "media": {}, "type": "", "start_date": {"year": 1765}, "event_types": []}, {"display_date": "October 30, 1765", "background": "", "end_date": {}, "text": {"headline": "Medford listed in records", "text": "Medford listed as a \"free negro\" in First Churches records. This date may either be a baptism date or a death date. (First Churches Records)"}, "media": {}, "type": "", "start_date": {"month": 10, "day": 30, "year": 1765}, "event_types": []}, {"display_date": "1766", "background": "", "end_date": {}, "text": {"headline": "Philemon Lee warned out of Northampton and jailed", "text": "Philemon Lee was warned out of Northampton, but returned. He then was placed in jail in Springfield in Nov. 1767. (Hampshire Council of Government Records)"}, "media": {}, "type": "", "start_date": {"year": 1766}, "event_types": []}, {"display_date": "January 10, 1766", "background": "", "end_date": {}, "text": {"headline": "Asaph Hull died at age 10", "text": "Asaph Hull died in Connecticut, cause unknkown. He was 10 years old. (Northampton Overseers of the Poor Records)"}, "media": {}, "type": "", "start_date": {"month": 1, "day": 10, "year": 1766}, "event_types": []}, {"display_date": "June 18, 1766", "background": "", "end_date": {}, "text": {"headline": "Warrant filed to warn Philemon Lee out of Northampton", "text": "Warrant filed to warn Philemon Lee out of Northampton. Warnings out or cautions were deviced in which the board of selectmen controlled residency in the location the selectment administered. In the ruling, the selectmen were not required to give a reason for the caution and often did not, but the purpose of warnings out were generally to remove non-residents who required public support due to their economic circumstances. If circumstances changed (such as getting pregnant or older and requiring care), a non-resident who had lived in a town for years could still be warned out at any point. Besides economic reasons, a person could be warned out if neighbors complained about their behavior, opening the doors for already marginalized people to be expelled from New England towns. Even people of color who were lawful residents of New England town were unofficially warned out. (Hampshire Council of Government Records; Wallis Herndon, Unwelcome Americans: Living on the Margin in Early New England)"}, "media": {}, "type": "", "start_date": {"month": 6, "day": 18, "year": 1766}, "event_types": []}, {"display_date": "April 27, 1767", "background": "", "end_date": {}, "text": {"headline": "Philemon Lee removed by town", "text": "Philemon Lee refused to leave Northampton and was then removed by the town and taken back to Simsbury, CT. (Hampshire Council of Government Records)"}, "media": {}, "type": "", "start_date": {"month": 4, "day": 27, "year": 1767}, "event_types": []}, {"display_date": "May 1, 1767", "background": "", "end_date": {}, "text": {"headline": "Philemon Lee returned to Northampton", "text": "Philemon Lee returned to Northampton. The selectmen of the town convened legal proceedings against him again. (Hampshire Council of Government Records)"}, "media": {}, "type": "", "start_date": {"month": 5, "day": 1, "year": 1767}, "event_types": []}, {"display_date": "August 18, 1767", "background": "", "end_date": {}, "text": {"headline": "Philemon Lee jailed and released", "text": "Philemon Lee sent to jail in Springfield. He was held for one week and released on August 25th. He was released with a promise that he would never return to Northampton. (Hampshire Council of Government Records)"}, "media": {}, "type": "", "start_date": {"month": 8, "day": 18, "year": 1767}, "event_types": []}, {"display_date": "September 1, 1767", "background": "", "end_date": {}, "text": {"headline": "Philemon Lee returned to Northampton and jailed again", "text": "Philemon Lee returned to Northampton. The selectmen of the town convened legal proceedings against him once again and he was removed from Northampton and sent to jail in Springfield on November 10, 1767. During these proceedings, Lee expressed \"a Design and an Intention of obtaining an estate in Land in the Said Town of Northampton.\" It is likely that Lee was warned out due to racial motivations, as Lee had the funds to buy land in Northampton, and it was this exact desire for property ownership that led the selectmen to desire his removal.  (Hampshire Council of Government Records)"}, "media": {}, "type": "", "start_date": {"month": 9, "day": 1, "year": 1767}, "event_types": []}, {"display_date": "October 13, 167", "background": "", "end_date": {}, "text": {"headline": "Bess died", "text": "Bess, a woman of color, died. This may be the same person enslaved by Colonel John Stoddard, referred to as Elizabeth and Bes, but Elizabeth was also a common name for the time. (First Churches Records)"}, "media": {}, "type": "", "start_date": {"month": 10, "day": 13, "year": 1767}, "event_types": []}, {"display_date": "October 24, 1767", "background": "", "end_date": {}, "text": {"headline": "Robert accused of breaking and entering", "text": "Robert accused of breaking and entering into the \"mansion house\" of Charles Phelps in Hadley. In the house were Charles Phelps Jr., Dorothy Phelps, and Abigail Phelps. The charge stated that Robert entered the house \"with intent to commit fornication with and have carnal knowledge of the body of the said Dorothy and the said Abigail.\" He was later tried in Northampton for this charge. (Hampshire Council of Governments Records)"}, "media": {}, "type": "", "start_date": {"month": 10, "day": 24, "year": 1767}, "event_types": []}, {"display_date": "October 25, 1767", "background": "", "end_date": {}, "text": {"headline": "Robert accused of breaking and entering again", "text": "Robert accused of breaking and entering John Strickland's house in Hadley. Also in residence were John Clark, his wife (unnamed in the record), and his daughter Mary Clark. Once in the house, Robert was accused of \"then and there being in the same house with the intent to commit fornication with and have carnal knowledge of the said Mary Clark then being in Bed in the same house.\" He was charged by the representatives of the Crown's government in Massachusetts and later tried in Northampton. (Hampshire Council of Governments Records)"}, "media": {}, "type": "", "start_date": {"month": 10, "day": 25, "year": 1767}, "event_types": []}, {"display_date": "November 10, 1767", "background": "", "end_date": {}, "text": {"headline": "Robert tried and charged in court", "text": "Robert tried twice in the Inferior Court in Northampton for charges of breaking and entering (see earlier entries). Robert was a laborer by profession who lived in Hadley, MA. By the time of the trial, Robert had been imprisoned in Springfield, but was brought to Northampton for the trial and prosecuted by John Worthington, the King's council. In both cases, Robert said that he would \"not contend\", which appears to mean that he would not contest the charges. He was sentenced to be whipped ten lashes for each offense and pay £3 17s 11p for the first offense and £3 10s 11p for the second, considerable costs for the time. With a court record that includes so little testimony, it can be hard to tell exactly what happened. He may have been invited by the female occupants of the house, but not given permission by the homeowner (the man of the house). The Phelps family was one of the most prominent in Hadley, so if Robert was indeed invited by either woman, the breaking and entering charge could be less about actual ownership of the house and more about shielding the reputation of Dorothy and Abigail. If Robert was not invited in, adding a sexual assault motivation would be a way to impose a more severe punishment and satisfy the family doing the accusing. On a seperate note, Robert would have been in the courthouse at the same time as Philemon Lee (see seperate entry for Lee), so the two men likely would have crossed paths. (Hampshire Council of Government Records)"}, "media": {}, "type": "", "start_date": {"month": 11, "day": 10, "year": 1767}, "event_types": []}, {"display_date": "1768", "background": "", "end_date": {}, "text": {"headline": "Philemon Lee and Bathsheba Hull married", "text": "Philemon Lee and Bathsheba Hull married by 1768. It is unclear when their relationship began, but they likely were in a relationship during the process of Lee being warned out. This presents one reason why he would so consistently return to a place he had been legally expelled from: his family was there. Residency laws meant that even though Hull was a lawful resident of Northampton, her husband was not, since she was a woman. Therefore, breaking the couple apart was legal. (Trumbull, History of Northampton, Massachusetts; Judd Manuscript)"}, "media": {}, "type": "", "start_date": {"year": 1768}, "event_types": []}, {"display_date": "May 1768", "background": "", "end_date": {}, "text": {"headline": "Bathsheba and Margaret Hull warned out and moved to Stockbridge", "text": "In May 1768, Bathsheba and Margaret Hull moved to Springfield. Since they were not residents of Springfield, they were able to be warned out. After being warned out, the two went to Stockbridge and were reunited with Agrippa. (History of Northampton, Massachusetts; Judd Manuscript)"}, "media": {}, "type": "", "start_date": {"month": 5, "year": 1768}, "event_types": []}, {"display_date": "May 1768", "background": "", "end_date": {}, "text": {"headline": "Philemon Lee released from jail", "text": "Philemon Lee released from jail and again promised not to return to Northampton. As far as we know, he did not return. Since Bathsheba Hull and her daughter relocated to Springfield in the month Lee was released, they may have moved to meet him and start their lives in a new place. They also could have come to petition his release as support for his family (as a man, having access to more avenues of income) if Hull's situation in Northampton had deteriorated. (History of Northampton, Massachusetts; Judd Manuscript)"}, "media": {}, "type": "", "start_date": {"month": 5, "year": 1768}, "event_types": []}, {"display_date": "Between 1768-1791", "background": "", "end_date": {"year": "1791"}, "text": {"headline": "Philemon Lee died or was seperated", "text": "Philemon Lee died or he and Bathsheba Hull seperated. (Berkshire Court of Common Pleas)"}, "media": {}, "type": "", "start_date": {"year": 1768}, "event_types": []}, {"display_date": "1770", "background": "", "end_date": {}, "text": {"headline": "A person whose name we do not know was enslaved by Gideon Clark", "text": "A person whose name we do not know was enslaved by Gideon Clark and listed in the Northampton tax records from 1770. (Northampton Town Papers)"}, "media": {}, "type": "", "start_date": {"year": 1770}, "event_types": []}, {"display_date": "April 8, 1770", "background": "", "end_date": {}, "text": {"headline": "Lydia Hill admitted to First Church", "text": "Lydia Hill admitted to First Church in Northampton. The inclusion of a last name suggests that she was a free person at the time, but we do not know for sure. It is more certain that she was free later on. (First Churches Records)"}, "media": {}, "type": "", "start_date": {"month": 4, "day": 8, "year": 1770}, "event_types": []}, {"display_date": "1770s", "background": "", "end_date": {}, "text": {"headline": "Rose Binney conversion experience", "text": "Rose Binney had a conversion experience and joined a Stockbridge church. Dr. Stephen West, Edwards' successor as minister in Stockbridge, wrote about her conversion experience. He stated that the two discussed her belief that God was angry with her, causing death of her daughters. He also recounts a story of her milking a cow and seeing her surroundings illuminated by God's light. There may be some truth to West's accounts, but it is probable that West was influenced by his own reactions and religious beliefs and could not comprehend the psychological toll of being enslaved, seperated from family as a child, and losing four daughters. (Article by Dr. Stephen West in Minkema, Jonathan Edwards' Defense of Slavery)"}, "media": {}, "type": "", "start_date": {"year": 1770}, "event_types": []}, {"display_date": "1770s", "background": "", "end_date": {}, "text": {"headline": "Sylvia Church enslaved by Dwight family", "text": "Sylvia Church enslaved by the Dwight family in Northampton at their home on 93 King St. One account states that she was sold on Long Island age 9, so she may have come to the Dwights then. Timothy Dwight was a merchant and judge and his wife Mary was a strong-willed woman from a prominent family (she was the daughter of Jonathan Edwards). (Dwight, The History of the Descendants of John Dwight)"}, "media": {}, "type": "", "start_date": {"year": 1770}, "event_types": []}, {"display_date": "1770s", "background": "", "end_date": {}, "text": {"headline": "Paul indentured by John Wait", "text": "Paul, a child of around seven in Northampton, indentured by John Wait of Southampton. Paul would be an \"Apprentice in the art of husbandry.\" At this time, some towns would petition for court permission to place children of families who were on public support in indentured servitude. This could be done against the will of the parents if the justices agreed. Typically children being indentured for an apprenticeship like Paul were seven years or older, but selectmen did place children under seven in indentured servitude. Paul's mother was named Lydia and may have been Lydia Hill, who was on town support in the 1770s. (Northampton Overseers of the Poor Records; Judd Manuscript)"}, "media": {}, "type": "", "start_date": {"year": 1770}, "event_types": []}, {"display_date": "Between 1771-1774", "background": "", "end_date": {"year": "1774"}, "text": {"headline": "Abigail Mesen sick and cared for", "text": "Abigail Mesen, an indigenous woman listed as a \"pauper\", cared for by Nathaniel Day. In the Judd Manuscript, it is written that Day was reiumbursed for watching her, nursing her, and \"damage to bed.\" Given this description, Mesen was likely unwell. The town may have agreed to put her on public support, despite lack of residency, because she had a prior relationship with the town, because the person who brought her in had some leveraging power, or simply because it was the right thing for the town to do. This points to the selectivity with which warning out laws could be enforced, as someone with no claim was allowed to stay, while others would be forced to leave. (Judd Manuscript)"}, "media": {}, "type": "", "start_date": {"year": 1771}, "event_types": []}, {"display_date": "July 1772", "background": "", "end_date": {}, "text": {"headline": "Dinah died", "text": "Dinah died. (First Churches Records)"}, "media": {}, "type": "", "start_date": {"month": 7, "year": 1772}, "event_types": []}, {"display_date": "January 1775", "background": "", "end_date": {}, "text": {"headline": "Phillis taken to Docter Mather", "text": "Phillis mentioned in Elizabeth Porter Phelps' diary. Phelps writes about taking her to \"Docter Mather\" in Northampton, likely for tuberculosis. (Miller, Entangled Lives)"}, "media": {}, "type": "", "start_date": {"month": 1, "year": 1775}, "event_types": []}, {"display_date": "April 1775", "background": "", "end_date": {}, "text": {"headline": "Phillis died", "text": "Phillis died. Phelps wrote \"Fryday Morning a Little after eight our poor little Phillis left this world. O if she is gone to Bliss this enough pray Father Sanctify it to us all...Satterday We attended her Funeral.\" While Phillis was ill, her sister Rose was pregnant. After Phillis died, Rose named her newborn daughter Phillis. (Miller, Entangled Lives)"}, "media": {}, "type": "", "start_date": {"month": 4, "year": 1775}, "event_types": []}, {"display_date": "May 1775", "background": "", "end_date": {}, "text": {"headline": "Agrippa Hull enlisted in army", "text": "Agrippa Hull enlisted in the fledgling US army and fought in the American Revolution as a private for more than 6 years. He served as an assistant for General Tadeusz Kosciuszko, which may have been where he got his nickname, “Grip” or “Grippy.” He also worked with the Marquis de Lafayette and John Laurens (an abolitionist, but his family were large-scale enslavers) during the Revolution. Hull told a story that one night when Kosciuszko left the camp, Hull put on Kosciuszko’s military uniform and threw a party for all of the Black servants in the camp. (Nash, Russell, and Hodges, Friends of Liberty)"}, "media": {}, "type": "", "start_date": {"month": 5, "year": 1775}, "event_types": []}, {"display_date": "1778", "background": "", "end_date": {}, "text": {"headline": "Lydia Hill died", "text": "Lydia Hill named in a court record documenting expenses for Hill and her children. The fact that the town was involved in these expenses suggests that Hill was a free woman. Additionally, during the mid 18th century, Massachusetts law required that towns provide \"care\" or \"effective care\" for residents by either overseers of the poor or selectmen. Hill died in 1778 from a prolonged illness, perhaps one that caused her to need the town's aid in the first place. Hill is also possibly the mother of Paul, an indentured boy in Southampton. (Judd Manuscript; Northampton Overseers of the Poor Records)"}, "media": {}, "type": "", "start_date": {"year": 1778}, "event_types": []}, {"display_date": "early 1780s", "background": "", "end_date": {}, "text": {"headline": "Agrippa Hull married and had children", "text": "Agrippa Hull returned to Stockbridge, bought a piece of land, worked for Theodore Sedgewick, and helped support his mother, Bathsheba. Sedgewick was a lawyer who represented a previous enslaved person, so Jane Darby came to Sedgewick to ask him to help her gain her freedom from her enslaver, Mr. Ingersoll. She then was freed and she and Hull got married. They had three children, Charlotte, James, and Aseph. Hull also had two other children who passed away, but we do not know their names, when they were born, or if Jane Darby was their mother.  (Nash, Russell, and Hodges, Friends of Liberty)"}, "media": {}, "type": "", "start_date": {"year": 1780}, "event_types": []}, {"display_date": "Feburary 7, 1781", "background": "", "end_date": {}, "text": {"headline": "A boy of color died", "text": "A boy of color whose name we do not know died. We do not know whether he was enslaved or free. (Register of the deaths in Northampton)"}, "media": {}, "type": "", "start_date": {"month": 2, "day": 7, "year": 1781}, "event_types": []}, {"display_date": "1781", "background": "", "end_date": {}, "text": {"headline": "Tony sued Ezra Clapp and won", "text": "Tony sued Ezra Clapp for unlawful imprisonment. The case was tried in the courthouse in Northampton. Tony won, and Clapp was ordered to pay him £2. Tony's situation illustrates the fact that despite the ratification of the anti-slavery Massachusetts Constitution in 1780, slavery did not end.  (\"Uncovering the Stories of Black Families in Springfield and Hampden County, Massachusetts, 1650-1865\" in Historical Journal of Western Massachusetts, Westfield State University)"}, "media": {}, "type": "", "start_date": {"year": 1781}, "event_types": []}, {"display_date": "1782", "background": "", "end_date": {}, "text": {"headline": "Clamira baptized", "text": "The Binneys daughter Clamira was baptized. (Jones, Stockbridge, Past and Present)"}, "media": {}, "type": "", "start_date": {"year": 1782}, "event_types": []}, {"display_date": "1782", "background": "", "end_date": {}, "text": {"headline": "Self-emancipated person released from prison", "text": "A self-emancipated person whose name we do not know was mentioned in a newspaper report as being released from the prison in Northampton by a mob in 1782. The mob stormed the prison to release Samuel Ely, an activist who believed that the Massachusetts constitution was not fair to poor farmers. (Trumbull, History of Northampton, Massachusetts)"}, "media": {}, "type": "", "start_date": {"year": 1782}, "event_types": []}, {"display_date": "July 13, 1782", "background": "", "end_date": {}, "text": {"headline": "Indigenous man drowned", "text": "First Churches listed that \"an Indian fellow drowned at Old Rainbow\", but did not give his name. Old Rainbow was a location in the Northampton Meadows. (First Church Records)"}, "media": {}, "type": "", "start_date": {"month": 7, "day": 13, "year": 1782}, "event_types": []}, {"display_date": "1783", "background": "", "end_date": {}, "text": {"headline": "Joab Binney died", "text": "Joab Binney died and left his property to wife Rose and daughters Tamar and Clamira. Rose Binney may have remarried sometime after this to a man with the surname Salter. (Joab Binney will)"}, "media": {}, "type": "", "start_date": {"year": 1783}, "event_types": []}, {"display_date": "1783", "background": "", "end_date": {}, "text": {"headline": "Sylvia Church resided with Storrs family", "text": "Sylvia Church lived with the family of Nathan Storrs sometime after she was free. (Dwight, The History of the Descendants of John Dwight)"}, "media": {}, "type": "", "start_date": {"year": 1783}, "event_types": []}, {"display_date": "March 24, 1783", "background": "", "end_date": {}, "text": {"headline": "Margaret Hull married", "text": "Margaret Hull married Cesar Freeman in Great Barrington, MA. Freeman appears to have been free at the time of their marriage but we do not know if he was born free or was formerly enslaved. However, his first name was popular among enslaved persons and his surname was popular among emancipated persons, suggesting that even if he was not enslaved, one of his parents or grandparents might have been. (Great Barrington Marriages)"}, "media": {}, "type": "", "start_date": {"month": 3, "day": 24, "year": 1783}, "event_types": []}, {"display_date": "July 19, 1783", "background": "", "end_date": {}, "text": {"headline": "An Indigenous man died", "text": "An Indigenous man whose name who do not know died at age 16. (First Church Records)"}, "media": {}, "type": "", "start_date": {"month": 7, "day": 19, "year": 1783}, "event_types": []}, {"display_date": "July 19, 1783", "background": "", "end_date": {}, "text": {"headline": "An Indigenous woman died", "text": "An indigenous woman whose name we do not know died. The church records described her death using these words: \"A squaw lying in liquor lay in the sun til she died.\" (First Church Records)"}, "media": {}, "type": "", "start_date": {"month": 7, "day": 19, "year": 1783}, "event_types": []}, {"display_date": "May 8, 1785", "background": "", "end_date": {}, "text": {"headline": "Eunice died", "text": "Eunice, the indigenous woman that Amos Hull Jr. married, died. Her death is recorded in Belchertown, so it was likely that Hull may have moved there. (Rev. Justus Forward's Vital Records Books)"}, "media": {}, "type": "", "start_date": {"month": 5, "day": 8, "year": 1785}, "event_types": []}, {"display_date": "July 21, 1785", "background": "", "end_date": {}, "text": {"headline": "Hannah Pequin died", "text": "Hannah Pequin died. The record states that \"Hannah Pequin an Indian Girl was Executed for the Murder of her Bastard Child.\" Elizabeth Porter Phelps also wrote about this case in her diary, mentioning a \"poor squaw hanged in Northampton for murdering her infant babe\" in 1785. (Massachusetts Vital Records; Miller, Entangled Lives)"}, "media": {}, "type": "", "start_date": {"month": 7, "day": 21, "year": 1785}, "event_types": []}, {"display_date": "1790", "background": "", "end_date": {}, "text": {"headline": "Cornelius Thompson convicted of theft", "text": "Cornelius Thompson, desrcibed as \"negro\" and a resident of Conway, was convicted of theft in the town of Northampton. (Hampshire Gazette)"}, "media": {}, "type": "", "start_date": {"year": 1790}, "event_types": []}, {"display_date": "1791", "background": "", "end_date": {}, "text": {"headline": "Bathsheba Hull unwell", "text": "Bathsheba Hull was in a position where she needed to be cared for by her children. Her son Agrippa cared for her, but her daughter Margaret's husband, Cesar Freeman, did not. She sued him but the case was never legally resolved. It is clear that Freeman was unwilling to support Bathsheba, but it is unclear whether it was he or Margaret driving this decision. Bathsheba Hull likely died between 1791 and 1792. (Berkshire Court of Common Pleas)"}, "media": {}, "type": "", "start_date": {"year": 1791}, "event_types": []}, {"display_date": "1791", "background": "", "end_date": {}, "text": {"headline": "Court filing about Hull family", "text": "Agrippa and Margaret Hull stated that they were the only living children of Bathsheba Hull in a court filing. This implies that either Amos Hull died by 1791 or the family could not locate him because of lost contact or the record of desertion. (Berkshire Court of Common Pleas)"}, "media": {}, "type": "", "start_date": {"year": 1791}, "event_types": []}, {"display_date": "1795", "background": "", "end_date": {}, "text": {"headline": "Noah Gomar took his freedom", "text": "Noah Gomar took his freedom at age 19. He was indentured by Joseph Hutchens. This was reported in the Hampshire Gazette as well as other local newspapers."}, "media": {}, "type": "", "start_date": {"year": 1795}, "event_types": []}, {"display_date": "1797 or 1822", "background": "", "end_date": {}, "text": {"headline": "Rose Binney died", "text": "Rose Binney died. There are multiple accounts of Binney's death, one by West and another in the census record. The 1797 date seems more likely."}, "media": {}, "type": "", "start_date": {"year": 1797}, "event_types": []}, {"display_date": "1798", "background": "", "end_date": {}, "text": {"headline": "Sylvia Church had miscarriage", "text": "Sylvia Church may have had a stillbirth/miscarriage child. There were two women named Sylvia in Northampton at the time and it is unclear which women suffered this loss. (First Churches Records)"}, "media": {}, "type": "", "start_date": {"year": 1798}, "event_types": []}, {"display_date": "1798", "background": "", "end_date": {}, "text": {"headline": "Binneys rent out parent's land", "text": "The Binney daughters, Clamira and Tamar, rented out their parents' land, according to a property record. The land had one dwelling house and 25 acres of land. (Joab Binney will)"}, "media": {}, "type": "", "start_date": {"year": 1798}, "event_types": []}, {"display_date": "1790s?", "background": "", "end_date": {}, "text": {"headline": "Tamar Binney married and had children", "text": "Tamar Binney married Thomas Kellis and they had two children, Charles B. Kellis, who lived until 1819, and Dr. Joab Kellis, presumably named after Binney's father. Joab Kellis was the first Black physician in Stockbridge. He died in 1866 and his tombstone read \"Possessed of more than ordinary skill, honest and upright in all his [actions], and friend of the oppressed, he died lamented by all who knew him.\" (Jones, Stockbridge, Past and Present)"}, "media": {}, "type": "", "start_date": {"year": 1790}, "event_types": []}, {"display_date": "1800", "background": "", "end_date": {}, "text": {"headline": "Agrippa Hull landowner status", "text": "Agrippa Hull was the largest Black landowner in Stockbridge. (Nash, Russell, and Hodges, Friends of Liberty)"}, "media": {}, "type": "", "start_date": {"year": 1800}, "event_types": []}, {"display_date": "1802", "background": "", "end_date": {}, "text": {"headline": "Sylvia died", "text": "Sylvia died at nineteen years old. Her death record listed her as \"a negro woman living with Gn. Joseph Lyman\". Another record in that same volume lists a \"dead birth [born to] a negro...named Sylvia.\" We do not know if this referred to Sylvia (who would have been about 15 at the time) or Sylvia Church. (First Churches Records)"}, "media": {}, "type": "", "start_date": {"year": 1802}, "event_types": []}, {"display_date": "August 8, 1802", "background": "", "end_date": {}, "text": {"headline": "Susy Wells died", "text": "Susy Wells died. We know almost nothing about Susy Wells, except that he probably died quite young. She was listed as \"black girl\" in the register of deaths. (Register of deaths in Northampton)"}, "media": {}, "type": "", "start_date": {"month": 8, "day": 8, "year": 1802}, "event_types": []}, {"display_date": "September 13, 1811", "background": "", "end_date": {}, "text": {"headline": "Polly Palmer died", "text": "Polly Palmer died. She was listed as \"black\" in the Northampton register of deaths. (Register of the deaths in Northampton)"}, "media": {}, "type": "", "start_date": {"month": 9, "day": 13, "year": 1811}, "event_types": []}, {"display_date": "1813", "background": "", "end_date": {}, "text": {"headline": "Agrippa Hull remarried and adopted a child", "text": "Agrippa Hull remarried Margaret Timbrook (or Timebroke), commonly called Peggy. Timbroke was born in Newport, RI in 1789. Timbrook was a gifted chef and she made the wedding cakes for many in Stockbridge. The couple adopted a daughter named Mary Tilden, who was the biological daughter of a self-emancipated person from NY. (Nash, Russell, and Hodges, Friends of Liberty)"}, "media": {}, "type": "", "start_date": {"year": 1813}, "event_types": []}, {"display_date": "1822", "background": "", "end_date": {}, "text": {"headline": "Sylvia Church died and buried in Bridge Street Cemetery", "text": "Sylvia Church died at 66 years old. She is one of a few people of color born in the 1700s to be buried in Bridge Street Cemetery. She is buried with the Storrs family and her headstone reads “Very few possessed more good qualities than she did.” (Dwight, The History of the Descendants of John Dwight)"}, "media": {}, "type": "", "start_date": {"year": 1822}, "event_types": []}, {"display_date": "1830", "background": "", "end_date": {}, "text": {"headline": "Clamira Binney married", "text": "Clamira Binney married Nicholas Rich. Clamira lived to be 74 years old and died on May 3, 1854 of dropsy (now known as edema), an excess of watery fluid collecting in the cavities or tissues of the body. (Jones, Stockbridge, Past and Present)"}, "media": {}, "type": "", "start_date": {"year": 1830}, "event_types": []}, {"display_date": "1830s", "background": "", "end_date": {}, "text": {"headline": "Agrippa Hull sold land", "text": "Agrippa Hull sold off some of his land. However, he was still a fixture of Stockbridge society, known for his charming personality and being and a source of information about the war (as he was a veteran). He would retell tales from the Revolution and show off objects that he retained from his service. (Nash, Russell, and Hodges, Friends of Liberty)"}, "media": {}, "type": "", "start_date": {"year": 1830}, "event_types": []}, {"display_date": "undated", "background": "", "end_date": {}, "text": {"headline": "A person whose name we do not know was enslaved by Robert Breck", "text": "A person whose name we do not know was enslaved by Robert Breck, as listed in an undated Northampton tax record. (Northampton Town Papers)"}, "media": {}, "type": "", "start_date": {"year": 1840}, "event_types": []}, {"display_date": "undated", "background": "", "end_date": {}, "text": {"headline": "Harry servant to Enos Kingsley", "text": "Harry was listed as an \"Indian servant\" to Enos Kingsley in the Judd Manuscript. It seems that Judd found him in a probate record when he willed a gun and a few miscellaneous objects to two people who Judd did not identify. Since we have not seen the original record that Judd based his notation on, we cannot be more specific. (Judd Manuscript)"}, "media": {}, "type": "", "start_date": {"year": 1840}, "event_types": []}, {"display_date": "undated", "background": "", "end_date": {}, "text": {"headline": "Peter enslaved by Joseph Hawley III", "text": "Sylvester Judd (Judd Manuscript) lists Peter as \"probably\" being an enslaved person. Peter was hired by Joseph Hawley III, though probably not enslaved by him. At the time when Hawley hired him, Peter was a child, but we do not know when he was hired. This would have entailed Hawley using the labor of Peter, but mostly or entirely paying his wages to the person who enslaved Peter (who is also not listed). Hawley lived from 1723-1788, so that is currently the window of time in which we know Peter lived."}, "media": {}, "type": "", "start_date": {"year": 1840}, "event_types": []}], "title": [{"media": {"url": "", "caption": "", "thumbnail": "", "credit": ""}, "text": {"headline": "Google Spreadsheet Example", "text": "This is a test of using google spreadsheets as a source for the timeline tool. This is a 'title' slide, so it doesn't need a date. It automatically occurs first, and doesn't appear in the timeline below."}}]}
